Repository: turris-cz/reforis-remote-access
Catalog: reforis_remote_access/translations/*/LC_MESSAGES/messages.po
Languages: es, sk, ta

source: Remote Access
es: Control Remoto
sk: Vzdialený prístup
ta: தொலைநிலை அணுகல்

source: Access Settings
es: Ajustes de acceso
sk: Nastavenia prístupu
ta: அமைப்புகள் அணுகல்

source: Here you can set up your router to be configured remotely. The remote configuration is done via a secure encrypted connection, and each client is required to have a token issued by this device.
es: Aquí puede configurar su router para que se configure de forma remota. La configuración remota se realiza a través de una conexión encriptada segura, y cada cliente debe tener un token emitido por este dispositivo.
sk: Tu je možné nastaviť vzdialenú konfiguráciu vášho routra. Prebieha prostredníctvom zabezpečeného šifrovaného pripojenia a každý klient musí mať token vydaný týmto zariadením.
ta: தொலைதூரத்தில் கட்டமைக்க உங்கள் திசைவியை இங்கே அமைக்கலாம். தொலைநிலை உள்ளமைவு பாதுகாப்பான மறைகுறியாக்கப்பட்ட இணைப்பு வழியாக செய்யப்படுகிறது, மேலும் ஒவ்வொரு வாடிக்கையாளருக்கும் இந்த சாதனத்தால் கிள்ளாக்கு வழங்கப்பட வேண்டும்.

source: It can be useful when you plan to access the configuration interface from another Turris router, or you intend to write your client.
es: Puede ser útil cuando se planea acceder a la interfaz de configuración desde otro router Turris, o si se pretende escribir en el cliente.
sk: Vhodné, ak chcete pristupovať ku konfiguračnému rozhraniu z iného routra Turris alebo ak máte v úmysle napísať si vlastného klienta.
ta: மற்றொரு டூரிச் திசைவியிலிருந்து உள்ளமைவு இடைமுகத்தை அணுக நீங்கள் திட்டமிடும்போது அல்லது உங்கள் கிளையண்டை எழுத விரும்பும் போது இது பயனுள்ளதாக இருக்கும்.

source: Generating Certificate Authority
es: Generando la autoridad de certificados
sk: Generuje sa certifikačná autorita
ta: சான்றிதழ் அதிகாரத்தை உருவாக்குதல்

source: Your certificate authority is now being generated. It usually takes a few minutes. Settings will appear here automatically once the authority is ready.
es: Su autoridad de certificación está siendo generada. Normalmente toma unos minutos. Las opciones de configuración aparecerán aquí automáticamente una vez que la autoridad esté lista.
sk: Teraz sa generuje vaša certifikačná autorita. Zvyčajne to trvá niekoľko minút. Keď bude autorita pripravená, automaticky sa tu zobrazia nastavenia.
ta: உங்கள் சான்றிதழ் அதிகாரம் இப்போது உருவாக்கப்படுகிறது. இது பொதுவாக சில நிமிடங்கள் ஆகும். அதிகாரம் தயாரானவுடன் அமைப்புகள் தானாகவே இங்கு தோன்றும்.

source: Cannot generate certificate authority.
es: No se puede generar la autoridad de certificación.
sk: Certifikačná autorita sa nedá vygenerovať.
ta: சான்றிதழ் அதிகாரத்தை உருவாக்க முடியாது.

source: No Certificate Authority
es: Sin autoridad de certificación
sk: Žiadna certifikačná autorita
ta: சான்றிதழ் அதிகாரம் இல்லை

source: Currently, there is no certificate authority (CA) dedicated to remote access. A CA is required to generate access tokens to authenticate. To proceed, you need to generate it first.
es: Actualmente no existe ninguna autoridad de certificación (CA) dedicada al acceso remoto. Se necesita una CA para generar tokens de acceso para autenticarse. Para proceder, es necesario generarla primero.
sk: V tejto chvíli neexistuje žiadna certifikačná autorita (CA) určená na vzdialený prístup. CA je nevyhnutná na generovanie overovacích prístupových tokenov. Ak chcete pokračovať, je najskôr potrebné CA vygenerovať.
ta: தற்போது, தொலைநிலை அணுகலுக்காக அர்ப்பணிக்கப்பட்ட சான்றிதழ் ஆணையம் (CA) இல்லை. அங்கீகரிக்க அணுகல் டோக்கன்களை உருவாக்க ஒரு CA தேவைப்படுகிறது. தொடர, நீங்கள் முதலில் அதை உருவாக்க வேண்டும்.

source: Generate Certificate Authority
es: Generar una autoridad de certificación
sk: Vygenerovať certifikačnú autoritu
ta: சான்றிதழ் அதிகாரத்தை உருவாக்குங்கள்

source: Cannot delete certificate authority.
es: No se puede eliminar la autoridad de certificación.
sk: Certifikačná autorita sa nedá vymazať.
ta: சான்றிதழ் அதிகாரத்தை நீக்க முடியாது.

source: Certificate Authority
es: Organismo certificador
sk: Certifikačná autorita
ta: சான்றிதழ் ஆணையம்

source: You can't delete certificate authority while remote access is enabled. To delete it, you need to disable the access first.
es: No puede eliminar una CA si el acceso remoto está habilitado. Para eliminarlo, primero debes deshabilitar el acceso.
sk: Kým je povolený vzdialený prístup, vymazanie certifikačnej autority nie je možné. Ak ju chcete odstrániť, je predtým potrebné vzdialený prístup zakázať.
ta: தொலைநிலை அணுகல் இயக்கப்பட்டிருக்கும் போது நீங்கள் சான்றிதழ் அதிகாரத்தை நீக்க முடியாது. அதை நீக்க, நீங்கள் முதலில் அணுகலை முடக்க வேண்டும்.

source: Your certificate authority is set up properly. Please note that if you delete it, all clients will have their access revoked.
es: Su CA está configurada correctamente. Tenga en cuenta que eliminarlo negará el acceso a todos los clientes.
sk: Vaša certifikačná autorita je správne nastavená. Nezabudnite, že jej odstránením sa zakáže prístup všetkým klientom.
ta: உங்கள் சான்றிதழ் அதிகாரம் சரியாக அமைக்கப்பட்டுள்ளது. நீங்கள் அதை நீக்கினால், எல்லா வாடிக்கையாளர்களும் தங்கள் அணுகல் ரத்து செய்யப்படுவார்கள் என்பதை நினைவில் கொள்க.

source: Delete Certificate Authority
es: Eliminar la autoridad de certificación
sk: Vymazať certifikačnú autoritu
ta: சான்றிதழ் அதிகாரத்தை நீக்கு

source: Cannot save connection parameters.
es: No se pueden guardar los parámetros de la conexión.
sk: Parametre pripojenia sa nedajú uložiť.
ta: இணைப்பு அளவுருக்களைச் சேமிக்க முடியாது.

source: Enable Remote Access
es: Activar el acceso remoto
sk: Povoliť vzdialený prístup
ta: தொலைநிலை அணுகலை இயக்கவும்

source: Accessible via WAN
es: Accesible mediante WAN
sk: Prístupné cez WAN
ta: வான் வழியாக அணுகலாம்

source: Devices in the WAN network will be able to connect to the configuration interface. Otherwise, only devices on LAN will be able to access it.
es: Los dispositivos en la WAN podrán conectarse a la interfaz de configuración. De lo contrario, sólo los dispositivos de la LAN tienen acceso.
sk: Zariadenia v sieti WAN sa budú môcť pripojiť ku konfiguračnému rozhraniu. V opačnom prípade k nemu budú môcť pristupovať len zariadenia v sieti LAN.
ta: வான் நெட்வொர்க்கில் உள்ள சாதனங்கள் உள்ளமைவு இடைமுகத்துடன் இணைக்க முடியும். இல்லையெனில், LAN இல் உள்ள சாதனங்கள் மட்டுமே அதை அணுக முடியும்.

source: Port
es: Puerto
ta: துறைமுகம்

source: A port which will be opened for the remote configuration of this device.
es: El puerto que se abrirá para la configuración remota de este dispositivo.
sk: Port, ktorý bude otvorený pre vzdialenú konfiguráciu tohto zariadenia.
ta: இந்த சாதனத்தின் தொலை கட்டமைப்பிற்கு திறக்கப்படும் ஒரு துறை.

source: Save
es: Guardar
sk: Uložiť
ta: சேமி

source: Should be a number in range of 1024-65536
es: Debe ser un número en el rango de 1024-65536
sk: Musí byť číslo z rozsahu 1024-65536
ta: 1024-65536 வரம்பில் ஒரு எண்ணாக இருக்க வேண்டும்

source: Access Tokens
es: Tokens de acceso
sk: Prístupové tokeny
ta: டோக்கன்களை அணுகவும்

source: You need to generate certificate authority to create tokens.
es: Necesitas generar una autoridad de certificación para crear tokens.
sk: Na vytvárane tokenov je potrebné vygenerovať certifikačnú autoritu.
ta: டோக்கன்களை உருவாக்க நீங்கள் சான்றிதழ் அதிகாரத்தை உருவாக்க வேண்டும்.

source: You need to generate a token file for each client you want to grant access to.
es: Debe generar un archivo token para cada cliente al que desee otorgar acceso.
sk: Pre každého klienta, ktorému sa má povoliť prístup, je potrebné vygenerovať súbor s tokenom.
ta: நீங்கள் அணுகலை வழங்க விரும்பும் ஒவ்வொரு வாடிக்கையாளருக்கும் ஒரு கிள்ளாக்கு கோப்பை உருவாக்க வேண்டும்.

source: To use the token with another Turris router you need to transfer it using the "Remote Devices" plugin on the client device.
es: Para usar el token con otro enrutador Turris, debe transferirlo usando el complemento "Dispositivos remotos" en el dispositivo cliente.
sk: Ak sa má token používať s iným routerom Turris, musí sa preniesť pomocou pluginu „Vzdialené zariadenia“ („Remote devices“) v klientskom zariadení.
ta: மற்றொரு டர்ரிச் திசைவியுடன் கிள்ளாக்கைப் பயன்படுத்த நீங்கள் கிளையன்ட் சாதனத்தில் "தொலை சாதனங்கள்" சொருகி பயன்படுத்தி அதை மாற்ற வேண்டும்.

source: Create Token
es: Crear token
sk: Vytvoriť token
ta: கிள்ளாக்கை உருவாக்கவும்

source: Token name
es: Nombre del token
sk: Názov tokenu
ta: கிள்ளாக்கு பெயர்

source: Shorter than 64 characters. Only alphanumeric characters, dots, dashes and underscores.
es: Menos de 64 caracteres. Sólo caracteres alfanuméricos, puntos, guiones y guiones bajos.
sk: Menej ako 64 znakov. Len alfanumerické znaky, bodka, spojovník a znak podčiarkutia.
ta: 64 எழுத்துகளுக்கு குறைவாக. எண்ணெழுத்து எழுத்துக்கள், புள்ளிகள், கோடுகள் மற்றும் அடிக்கோடிட்டுக் காட்டுகின்றன.

source: Add
es: Añadir
sk: Pridať
ta: கூட்டு

source: Name cannot be empty
es: El nombre no puede estar vacío
sk: Názov nesmie byť prázdny
ta: பெயர் காலியாக இருக்க முடியாது

source: Name is too long
es: El nombre es demasiado largo
sk: Názov je príliš dlhý
ta: பெயர் மிக நீளமானது

source: Name contains invalid characters
es: El nombre contiene caracteres inválidos
sk: Názov obsahuje neplatné znaky
ta: பெயரில் தவறான எழுத்துக்கள் உள்ளன

source: Tokens
sk: Tokeny
ta: டோக்கன்கள்

source: There are no tokens added yet.
es: No hay tokens añadidos aún.
sk: Zatiaľ nie sú pridané žiadne tokeny.
ta: டோக்கன்கள் இதுவரை சேர்க்கப்படவில்லை.

source: Name
es: Nombre
sk: Názov
ta: பெயர்

source: Actions
es: Actuaciones
sk: Akcie
ta: செயல்கள்

source: Access revoked
es: Se revocó el acceso
sk: Prístup odvolaný
ta: அணுகல் ரத்து செய்யப்பட்டது

source: Download
es: Descargar
sk: Stiahnuť
ta: பதிவிறக்கம்

source: Revoke
es: Revocar
sk: Odvolať
ta: ரத்து செய்யுங்கள்

source: Certificate authority already exists.
es: La autoridad de certificación ya existe.
sk: Certifikačná autorita už existuje.
ta: சான்றிதழ் அதிகாரம் ஏற்கனவே உள்ளது.

source: Cannot change settings.
es: No se puede cambiar los ajustes.
sk: Nastavenia sa nedajú zmeniť.
ta: அமைப்புகளை மாற்ற முடியாது.

source: Token '{}' already exists.
es: El token '{}' ya existe.
sk: Token '{}' už existuje.
ta: கிள்ளாக்கு '{}' ஏற்கனவே உள்ளது.

source: Cannot create token.
es: No se puede crear el token.
sk: Token sa nedá vytvoriť.
ta: கிள்ளாக்கை உருவாக்க முடியாது.

source: Requested token does not exist.
es: El token solicitado no existe.
sk: Požadovaný token neexistuje.
ta: கோரப்பட்ட கிள்ளாக்கு இல்லை.

source: Cannot get token.
es: No se puede obtener el token.
sk: Nedá sa získať token.
ta: கிள்ளாக்கு பெற முடியாது.

source: Cannot revoke token.
es: No se puede revocar el token.
sk: Token sa nedá odvolať.
ta: கிள்ளாக்கை ரத்து செய்ய முடியாது.
